{
    "Budget": "A plan for how to spend and save your money for a time period (month, year, etc.)",
    "Income": "The money you earn from work, investments, or other sources",
    "Expenses": "The costs incurred to operate a business or live (rent, utilities, supplies)",
    "Fixed Expenses": "Regular bills that stay the same each month (rent, car payments)",
    "Variable Expenses": "Bills that change every month, (utility bills, groceries)",
    "Savings": "Money you set aside for future needs (big purchases, retirement)",
    "Emergency Fund": "Money saved for unexpected costs (medical bills, car repairs)",
    "Debt": "Money owed to others, which must be repaid over time",
    "Credit": "The ability to borrow money with the promise to pay it back later ",
    "Discretionary Spending": "Extra money spent on things that aren’t necessary (eating out, entertainment)",
    "Budget Surplus": "When you have extra money after covering all your expenses",
    "Cash Flow": "The movement of money into and out of your bank account",
    "Percentage of Income": "A budgeting method where you set aside a fixed percentage of your income for different categories",
    "Short-Term Goals": "Financial goals that can be achieved in less than a year (saving for a trip, paying off small debt)",
    "Long-Term Goals": "Bigger financial goals that take several years to achieve (buying a house, retirement saving)",
    "Tracking": "Keeping a record of your income and expenses to see where your money goes",
    "Accountability Partner": "Someone who helps you stick to your budget and financial goals by checking in with you regularly",
    "Investment": "Putting money into something to grow your wealth over time (stocks, bonds, real estate)",
    "Stock": "A share of ownership in a company that can increase or decrease in value",
    "Bond": "A loan you give to a company or government, which they pay back with interest over time",
    "Dividend": "A payment made by a company to its shareholders, usually from profits",
    "Shareholder": "A person or entity that owns shares (stock) in a company",
    "Stock Market": "A place where stocks (company shares) are bought and sold",
    "Public Company": "A company whose shares are traded on a stock exchange and available for the public to buy",
    "Private Company": "A company whose shares are not available to the general public and are typically owned by a small group of investors",
    "Portfolio": "A collection of investments that an investor owns",
    "Risk": "The chance that you could lose money in an investment",
    "Return": "The money you make (or lose) from an investment, usually expressed as a percentage",
    "Diversification": "Spreading your investments across different types of assets to reduce risk",
    "Exchange-Traded Fund (ETF)": "A type of investment fund that holds a collection of assets but is traded like a stock",
    "Capital Gain": "The profit from selling an investment for more than you paid for it",
    "Bear Market": "A market condition where prices are falling or expected to fall",
    "Bull Market": "A market condition where prices are rising or expected to rise",
    "Asset": "Anything of value that can be invested in (stocks, real estate, cash)",
    "Liquidity": "The ease of which you can convert an asset into cash without losing value",
    "Risk Tolerance": "The level of risk an investor is willing to take based on their financial goals and comfort level",
    "Volatility": "The degree of price fluctuations in the market or a specific investment (higher volatility means bigger changes in price)",
    "Tax": "Money that individuals or businesses pay to the government",
    "Income Tax": "A tax on the money you earn from work, investments, or business",
    "Sales Tax": "A tax added to the price of goods and services you buy, typically paid at the time of purchase",
    "Property Tax": "A tax on the value of property you own (land, buildings, vehicles)",
    "Tax Deduction": "An amount of money subtracted from your total taxable income, reducing the tax amount you owe",
    "Tax Credit": "A direct reduction in the amount of tax you owe, often for things like education, childcare, or energy-saving improvements",
    "Filing Status": "Your classification for tax purposes (single, married) which affects your tax rates and deductions",
    "Taxable Income": "The amount of income that is subject to tax, after deductions and exemptions are subtracted",
    "Withholding": "The money your employer automatically takes out of your paycheck and sends to the government to cover your taxes",
    "W-2 Form": "A form that employers send to employees, showing how much they earned and how much tax was withheld",
    "W-4 Form": "A form that employees fill out to let their employer know how much tax to withhold from their paycheck",
    "IRS (Internal Revenue Service)": "The US government agency responsible for collecting taxes and enforcing tax laws",
    "Self-Employment Tax": "A tax that people who work for themselves  pay to cover Social Security and Medicare",
    "Tax Bracket": "The range of income that is taxed at a specific rate. The more income you make, the higher your tax bracket. ",
    "Capital Gains Tax": "A tax on the profit you make from selling investments or property for more than you paid for them",
    "Audit": "An examination by the IRS to ensure that your tax return is accurate and you've paid the correct tax amount",
    "Refund": "The money returned to you by the IRS if you paid more taxes than you owed during the year",
    "Gross Income": "The total income you earn before taxes and other deductions are taken out",
    "Net Income": "The amount of money you have left after taxes and expenses are deducted from your total income",
    "Assets": "Things of value that you own (cash, property, investments)",
    "Liabilities": "Debts or financial obligations that you owe (loans, credit card balances)",
    "Equity": "The value of your ownership in something (what you owe versus what you own)",
    "Revenue": "The income generated from the sale of products before any expenses are subtracted",
    "Profit": "The money made after subtracting expenses from revenue",
    "Net Worth": "The total value of what you own (assets) minus what you owe (liabilities)",
    "Interest": "The cost of borrowing money or the return on investments, usually expressed as a percentage",
    "Loan": "Money borrowed that must be paid back with interest over a specified period",
    "Return on Investment (ROI)": "A measure of how much profit you make from an investment, typically expressed as a percentage of the original investment",
    "Principal": "The original amount of money borrowed or invested, not including interest",
    "Financial independence": "The ability to support yourself without relying on employment income, often through investments or savings",
    "Capital": "The wealth (money or assets) used for investment or to start a business",
    "Bank Statement": "A document that shows all transactions made within a bank account over a specific period, such as deposits and withdrawals",
    "Financial Plan": "A comprehensive strategy that outlines how to manage money, save interest, and achieve financial goals",
    "Income Statement": "Shows how much money a company made and spent over a period of time (income, expenses, and if it made a profit)",
    "Balance Sheet": "Snapshot of what a company owns (assets) and what it owes (liabilities) at a certain point of time",
    "Cash Flow Statement": "Statement that shows how cash moves in and out of a company. It tells if the company is getting enough cash to pay its bills, invest, and make money in the future",
    "Supply": "The amount of a good or service that producers are willing and able to sell at different prices.",
    "Demand": "The amount of a good or service that consumers are willing and able to buy at different prices.",
    "Market": "A place where buyers and sellers come together to exchange goods and services.",
    "Price": "The amount of money needed to buy a good or service.",
    "Equilibrium": "The point where supply equals demand, and the price stabilizes.",
    "Scarcity": "The limited availability of resources to meet unlimited wants and needs.",
    "Opportunity Cost": "The value of the next best alternative that you give up when making a decision.",
    "Elasticity": "A measure of how much demand or supply changes in response to price changes.",
    "Substitute": "A product or service that can be used in place of another",
    "Compliment": "A product or service that is used together with another (e.g., printers and ink cartridges).",
    "Marginal Utility": "The additional satisfaction or benefit received from consuming one more unit of a good or service.",
    "Monopoly": "A market structure where there is only one producer or seller of a good or service, making them the sole supplier.",
    "Utility": "the satisfaction or pleasure a person gets from consuming a good or service. The higher the utility, the more benefit a person gets from it.",
    "Perfect Competition": "A market structure with many buyers and sellers, where no single seller can influence the price of goods or services.",
    "Oligopoly": "A market structure where a few companies dominate and have the power to influence prices",
    "Cost of Production": "The total cost of resources used to produce goods or services, including labor, materials, and overhead.",
    "Fixed Cost": "Costs that do not change, no matter how much is produced, like rent or salaries.",
    "Variable Cost": "Costs that change depending on how much is produced, such as raw materials or hourly wages.",
    "Consumer Surplus": "The difference between what consumers are willing to pay for a good and what they actually pay.",
    "Producer Surplus": "The difference between the price a producer is willing to sell a good for and the price they actually receive.",
    "Gross Domestic Product (GDP)": "The total value of all goods and services produced within a country's borders in a given time period.",
    "Inflation": "The rate at which the general level of prices for goods and services is rising, and purchasing power is falling.",
    "Unemployment Rate": "The percentage of people in the workforce who are actively looking for work but can't find a job.",
    "Recession": "A period of economic decline where GDP falls for two consecutive quarters or more.",
    "Fiscal Policy": "Government policies related to spending and taxation to influence the economy.",
    "Monetary Policy": "Actions by a central bank to control the money supply and interest rates to stabilize the economy.",
    "Interest Rate": "The cost of borrowing money, usually expressed as a percentage of the loan amount per year.",
    "National Debt": "The total amount of money a government owes to creditors.",
    "Budget Deficit": "When a government spends more money than it collects in revenue, leading to borrowing to cover the gap.",
    "Government Spending": "The money a government spends on public services, infrastructure, defense, etc.",
    "Tax Revenue": "The income a government collects through taxes on individuals and businesses.",
    "Aggregate Demand": "The total demand for goods and services in an economy at different price levels and over a certain period.",
    "Aggregate Supply": "The total supply of goods and services produced in an economy at different price levels.",
    "Exchange Rate": "The value of one currency compared to another, showing how much one currency is worth in terms of another.",
    "Stagflation": "A situation where an economy experiences both high inflation and high unemployment at the same time.",
    "Business Cycle": "The natural rise and fall of economic activity over time, including periods of expansion and contraction.",
    "Consumer Price Index (CPI)": "A measure that examines the average change in prices paid by consumers for goods and services over time, often used to track inflation.",
    "Imports": "Goods or services that are bought from other countries.",
    "Exports": "Goods or services that are sold to other countries."
  }